@extends('main/main')
@section('title', 'About Us')
@section('content')
    <h2 class="text-2xl font-bold mb-5 dark:text-white">О СЕРВИСЕ</h2>
    <div class="text-and-logo flex items-center justify-center gap-10 mb-[50px] max-tablet:flex-col-reverse">
        <div class="logo">
            <svg width="300" height="177" viewBox="0 0 100 63" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path class="stroke-black dark:stroke-white" d="M82.2223 43.9117C82.2223 48.4396 81.3151 51.5395 79.8985 53.7157C78.4978 55.8673 76.4421 57.3572 73.6777 58.3896C70.8701 59.4382 67.4095 59.9837 63.3512 60.2511C59.5447 60.5019 55.3689 60.5009 50.8774 60.4998C50.5863 60.4998 50.2938 60.4997 50.0001 60.4997C49.7063 60.4997 49.4138 60.4998 49.1227 60.4998C44.6312 60.5009 40.4554 60.5019 36.6489 60.2511C32.5906 59.9837 29.1301 59.4382 26.3224 58.3896C23.558 57.3572 21.5023 55.8673 20.1016 53.7157C18.685 51.5395 17.7778 48.4396 17.7778 43.9117C17.7778 25.8622 32.2317 11.2803 50.0001 11.2803C67.7684 11.2803 82.2223 25.8622 82.2223 43.9117Z" stroke="black" stroke-width="5"/>
                <path class="fill-black dark:fill-white" d="M66.2038 40.1643C66.2038 46.6318 63.6129 45.7853 60.4168 45.7853C57.2207 45.7853 54.6298 46.6318 54.6298 40.1643C54.6298 33.6968 57.2207 28.4539 60.4168 28.4539C63.6129 28.4539 66.2038 33.6968 66.2038 40.1643Z" fill="black"/>
                <ellipse class="fill-white dark:fill-black" cx="62.1529" cy="33.4893" rx="1.73611" ry="1.75657" fill="white"/>
                <path class="fill-black dark:fill-white" d="M45.3705 40.1643C45.3705 46.6318 42.7795 45.7853 39.5834 45.7853C36.3873 45.7853 33.7964 46.6318 33.7964 40.1643C33.7964 33.6968 36.3873 28.4539 39.5834 28.4539C42.7795 28.4539 45.3705 33.6968 45.3705 40.1643Z" fill="black"/>
                <ellipse class="fill-white dark:fill-black" cx="41.3195" cy="33.4893" rx="1.73611" ry="1.75657" fill="white"/>
                <path class="stroke-black dark:stroke-white dark:fill-white" d="M15.2777 49.451C15.2777 52.2125 13.0391 54.451 10.2777 54.451H5.21244C4.22848 54.451 3.25313 54.1595 2.64169 53.3886C1.54728 52.0088 -6.77109e-05 49.1344 -6.77109e-05 43.9116C-6.77109e-05 38.6889 1.54728 35.8145 2.64168 34.4347C3.25313 33.6638 4.22848 33.3722 5.21244 33.3722H10.2777C13.0391 33.3722 15.2777 35.6108 15.2777 38.3722L15.2777 49.451Z" fill="black"/>
                <path class="stroke-black dark:stroke-white dark:fill-white" d="M84.7222 38.3722C84.7222 35.6108 86.9607 33.3722 89.7222 33.3722H94.7874C95.7714 33.3722 96.7467 33.6638 97.3582 34.4347C98.4526 35.8145 99.9999 38.6889 99.9999 43.9116C99.9999 49.1344 98.4526 52.0088 97.3582 53.3886C96.7467 54.1595 95.7714 54.4511 94.7874 54.4511H89.7222C86.9607 54.4511 84.7222 52.2125 84.7222 49.4511V38.3722Z" fill="black"/>
                <path class="stroke-black dark:stroke-white" d="M92 34.3653C92 26.0467 87.575 18.0688 79.6985 12.1867C71.8219 6.30455 61.1391 3 50 3C38.8609 3 28.178 6.30455 20.3015 12.1867C12.425 18.0688 8 26.0467 8 34.3653" stroke="black" stroke-width="5"/>
            </svg>
        </div>
        <div class="text w-1/2 text-xl dark:text-white max-tablet:w-2/3 max-mobileL:text-base max-mobileM:tex-sm">
            <p>
                Добро пожаловать на наш сайт “FreeModels” — платформу для обмена 3D моделями! Мы создали этот сервис, чтобы помочь дизайнерам, архитекторам, художникам и энтузиастам 3D моделирования делиться своими проектами и находить новые идеи.
                Наши цели:</p>
            <ul class="list-disc ml-10">
                <li>Свободный доступ: Все модели доступны для скачивания и использования бесплатно.</li>
                <li>        Сообщество: Мы поддерживаем активное сообщество, где пользователи могут публиковать свои работы, обмениваться идеями и обсуждать новые технологии в 3D моделировании.
                </li>
                <li>        Простота использования: Легкий интерфейс позволяет быстро загружать и искать модели, а также сортировать их по категориям.
                </li>
            </ul>
            <p>
                Здесь вы можете не только делиться своими проектами, но и находить вдохновение среди тысяч доступных моделей. Мы верим в силу творчества и открытых данных, и наш сервис — это место, где вы можете воплотить свои идеи в реальность.
            </p>
        </div>
    </div>
    <x-button href="{{ secure_url(route('register')) }}" text="Зарегистрироваться"  />
@endsection
<script>
    @section('js')
        const logoA = document.getElementById('logoA');
    @endsection
</script>
